In [43]:
import pandas as pd
#必要なデータを読み込む
df = pd.read_csv('C:/Users/otani/Desktop/python/exclude_work/Ex.12/analays.csv')
ex = pd.read_csv('C:/Users/otani/Desktop/python/exclude_work/Ex.12/ex_list.csv')
tar = pd.read_csv('C:/Users/otani/Desktop/python/exclude_work/Ex.12/tar_list.csv')

In [44]:
len(df)

6887

In [45]:
df.head(1)

,id,sex,birthday,age,agegrp,acquire_kkh,acquire_kkh2,loss_kkh,loss_kkh2,vis_prob,...,priority,past1,past2,past3,past4,past5,qty,receipt,segment,rm
0,5,male,1953/5/19,65,60-64,2008/4/1,2008,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2,E,0

In [46]:
ex.head(1)

    id
0  436

In [47]:
tar.head(1)

      id
0  25759

In [49]:
ex1 = ex['id'].str.strip('F')
len(ex1)

306

### 分からないのは除外データの中に文字が含まれていた場合に見つけ、除去する方法　もじもじ使えないのでファイル変更

In [50]:
from pandas import DataFrame
ex2 = DataFrame(ex1)
ex2.head(2)

    id
0  436
1  817

In [51]:
#import re

In [52]:
#aaa = re.sub('^(a-z,A-Z)+','',ex['id'])

In [53]:
#ex['id'].strip(re.sub('^(a-z,A-Z)+','',''))

In [55]:
#除外
ex3 = df[~df['id'].isin(ex2['id'])]
#抽出
forwarder_list = ex3[ex3['id'].isin(tar['id'])]

In [56]:
#確認
set(forwarder_list['id']) & set(ex2['id'])

set()

In [57]:
set(forwarder_list['id']) <= set(tar['id'])

True

In [58]:
#保存
forwarder_list.to_csv('C:/Users/otani/Desktop/python/exclude_work/Ex.12/forwarder_list.csv')